pgsql-pbench/output/arm/pgbench-all.out
pgbench: warning: scale option ignored, using count from pgbench_branches table (1250)
starting vacuum...end.
progress: 5.0 s, 930.8 tps, lat 1.071 ms stddev 0.403
progress: 10.0 s, 940.4 tps, lat 1.063 ms stddev 0.252
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1250
query mode: prepared
number of clients: 1
number of threads: 1
duration: 10 s
number of transactions actually processed: 9357
latency average = 1.067 ms
latency stddev = 0.336 ms
tps = 935.649321 (including connections establishing)
tps = 936.756477 (excluding connections establishing)
statement latencies in milliseconds:
         0.000  \set aid random(1, 100000 * :scale)
         0.000  \set bid random(1, 1 * :scale)
         0.000  \set tid random(1, 10 * :scale)
         0.000  \set delta random(-5000, 5000)
         0.032  BEGIN;
         0.113  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
         0.050  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
         0.070  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
         0.052  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
         0.042  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
         0.707  END;
pgbench: warning: scale option ignored, using count from pgbench_branches table (1250)
starting vacuum...end.
progress: 5.0 s, 1542.8 tps, lat 1.294 ms stddev 0.317
progress: 10.0 s, 1623.2 tps, lat 1.232 ms stddev 0.271
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1250
query mode: prepared
number of clients: 2
number of threads: 1
duration: 10 s
number of transactions actually processed: 15832
latency average = 1.262 ms
latency stddev = 0.296 ms
tps = 1583.016307 (including connections establishing)
tps = 1583.421063 (excluding connections establishing)
statement latencies in milliseconds:
         0.000  \set aid random(1, 100000 * :scale)
         0.000  \set bid random(1, 1 * :scale)
         0.000  \set tid random(1, 10 * :scale)
         0.000  \set delta random(-5000, 5000)
         0.030  BEGIN;
         0.111  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
         0.048  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
         0.068  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
         0.052  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
         0.042  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
         0.910  END;
pgbench: warning: scale option ignored, using count from pgbench_branches table (1250)
starting vacuum...end.
progress: 5.0 s, 2837.8 tps, lat 1.402 ms stddev 0.435
progress: 10.0 s, 2772.2 tps, lat 1.437 ms stddev 0.321
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1250
query mode: prepared
number of clients: 4
number of threads: 1
duration: 10 s
number of transactions actually processed: 28054
latency average = 1.419 ms
latency stddev = 0.383 ms
tps = 2805.091842 (including connections establishing)
tps = 2805.785265 (excluding connections establishing)
statement latencies in milliseconds:
         0.000  \set aid random(1, 100000 * :scale)
         0.000  \set bid random(1, 1 * :scale)
         0.000  \set tid random(1, 10 * :scale)
         0.000  \set delta random(-5000, 5000)
         0.032  BEGIN;
         0.111  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
         0.048  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
         0.067  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
         0.053  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
         0.042  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
         1.065  END;
pgbench: warning: scale option ignored, using count from pgbench_branches table (1250)
starting vacuum...end.
progress: 5.0 s, 4705.0 tps, lat 1.683 ms stddev 0.480
progress: 10.0 s, 4857.8 tps, lat 1.639 ms stddev 0.352
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1250
query mode: prepared
number of clients: 8
number of threads: 1
duration: 10 s
number of transactions actually processed: 47822
latency average = 1.660 ms
latency stddev = 0.420 ms
tps = 4781.722356 (including connections establishing)
tps = 4782.919848 (excluding connections establishing)
statement latencies in milliseconds:
         0.000  \set aid random(1, 100000 * :scale)
         0.000  \set bid random(1, 1 * :scale)
         0.000  \set tid random(1, 10 * :scale)
         0.000  \set delta random(-5000, 5000)
         0.046  BEGIN;
         0.122  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
         0.053  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
         0.071  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
         0.060  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
         0.045  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
         1.262  END;
pgbench: warning: scale option ignored, using count from pgbench_branches table (1250)
starting vacuum...end.
progress: 5.0 s, 7528.9 tps, lat 2.084 ms stddev 0.521
progress: 10.0 s, 7540.7 tps, lat 2.100 ms stddev 0.513
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1250
query mode: prepared
number of clients: 16
number of threads: 1
duration: 10 s
number of transactions actually processed: 75364
latency average = 2.092 ms
latency stddev = 0.517 ms
tps = 7535.536972 (including connections establishing)
tps = 7537.324958 (excluding connections establishing)
statement latencies in milliseconds:
         0.000  \set aid random(1, 100000 * :scale)
         0.000  \set bid random(1, 1 * :scale)
         0.000  \set tid random(1, 10 * :scale)
         0.000  \set delta random(-5000, 5000)
         0.083  BEGIN;
         0.144  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
         0.085  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
         0.098  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
         0.084  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
         0.057  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
         1.540  END;
pgbench: warning: scale option ignored, using count from pgbench_branches table (1250)
starting vacuum...end.
progress: 5.0 s, 8526.2 tps, lat 3.622 ms stddev 0.984
progress: 10.0 s, 8805.3 tps, lat 3.574 ms stddev 0.790
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1250
query mode: prepared
number of clients: 32
number of threads: 1
duration: 10 s
number of transactions actually processed: 86690
latency average = 3.598 ms
latency stddev = 0.891 ms
tps = 8657.236305 (including connections establishing)
tps = 8659.408862 (excluding connections establishing)
statement latencies in milliseconds:
         0.000  \set aid random(1, 100000 * :scale)
         0.000  \set bid random(1, 1 * :scale)
         0.000  \set tid random(1, 10 * :scale)
         0.000  \set delta random(-5000, 5000)
         0.237  BEGIN;
         0.323  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
         0.255  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
         0.223  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
         0.198  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
         0.136  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
         2.225  END;
pgbench: warning: scale option ignored, using count from pgbench_branches table (1250)
starting vacuum...end.
progress: 5.0 s, 11450.9 tps, lat 5.253 ms stddev 1.871
progress: 10.0 s, 12274.5 tps, lat 5.092 ms stddev 1.172
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1250
query mode: prepared
number of clients: 64
number of threads: 1
duration: 10 s
number of transactions actually processed: 118692
latency average = 5.172 ms
latency stddev = 1.561 ms
tps = 11835.604633 (including connections establishing)
tps = 11838.387536 (excluding connections establishing)
statement latencies in milliseconds:
         0.000  \set aid random(1, 100000 * :scale)
         0.000  \set bid random(1, 1 * :scale)
         0.000  \set tid random(1, 10 * :scale)
         0.000  \set delta random(-5000, 5000)
         0.413  BEGIN;
         0.576  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
         0.478  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
         0.417  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
         0.409  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
         0.286  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
         2.591  END;
pgbench: warning: scale option ignored, using count from pgbench_branches table (1250)
starting vacuum...end.
progress: 5.0 s, 11238.8 tps, lat 10.240 ms stddev 5.663
progress: 10.0 s, 9886.4 tps, lat 12.680 ms stddev 8.487
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1250
query mode: prepared
number of clients: 128
number of threads: 1
duration: 10 s
number of transactions actually processed: 105695
latency average = 11.409 ms
latency stddev = 7.351 ms
tps = 10411.440873 (including connections establishing)
tps = 10413.846984 (excluding connections establishing)
statement latencies in milliseconds:
         0.000  \set aid random(1, 100000 * :scale)
         0.000  \set bid random(1, 1 * :scale)
         0.000  \set tid random(1, 10 * :scale)
         0.000  \set delta random(-5000, 5000)
         0.773  BEGIN;
         1.089  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
         0.954  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
         0.906  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
         1.071  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
         0.660  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
         5.954  END;
pgbench: warning: scale option ignored, using count from pgbench_branches table (1250)
starting vacuum...end.
progress: 5.0 s, 10924.8 tps, lat 19.655 ms stddev 16.701
progress: 10.0 s, 13115.4 tps, lat 18.814 ms stddev 9.913
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1250
query mode: prepared
number of clients: 256
number of threads: 1
duration: 10 s
number of transactions actually processed: 120455
latency average = 19.292 ms
latency stddev = 13.764 ms
tps = 11787.797222 (including connections establishing)
tps = 11790.178215 (excluding connections establishing)
statement latencies in milliseconds:
         0.001  \set aid random(1, 100000 * :scale)
         0.000  \set bid random(1, 1 * :scale)
         0.000  \set tid random(1, 10 * :scale)
         0.000  \set delta random(-5000, 5000)
         1.271  BEGIN;
         1.785  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
         1.536  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
         1.678  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
         2.314  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
         1.415  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
         9.291  END;